update readme for initiation engine
